import type { Currency, LivePrice } from '@/lib/types';
import { RectangleEllipsis } from 'lucide-react';

export const currencies: Currency[] = [
  { code: 'IRT', name: 'تومان ایران' },
  { code: 'IRR', name: 'ریال ایران' },
  { code: 'USD', name: 'دلار آمریکا' },
  { code: 'EUR', name: 'یورو' },
  { code: 'GBP', name: 'پوند بریتانیا' },
  { code: 'JPY', name: 'ین ژاپن' },
  { code: 'AUD', name: 'دلار استرالیا' },
  { code: 'CAD', name: 'دلار کانادا' },
  { code: 'CHF', name: 'فرانک سوئیس' },
  { code: 'CNY', name: 'یوان چین' },
];

export const DEFAULT_USD_RATE = 590000;

export const mockExchangeRates: { [key: string]: number } = {
  // Rates against USD
  'USD-IRR': DEFAULT_USD_RATE, 
  'USD-EUR': 0.93,
  'USD-JPY': 157.7,
  'USD-GBP': 0.79,
  'USD-AUD': 1.51,
  'USD-CAD': 1.37,
  'USD-CHF': 0.9,
  'USD-CNY': 7.25,
};

export const provincialCapitals: string[] = [
    "تهران", "مشهد", "اصفهان", "کرج", "شیراز", "تبریز", "قم", "اهواز", 
    "کرمانشاه", "ارومیه", "رشت", "زاهدان", "همدان", "کرمان", "یزد", 
    "اردبیل", "بندرعباس", "اراک", "زنجان", "سنندج", "قزوین", 
    "خرم‌آباد", "گرگان", "ساری", "بجنورد", "بیرجند", "بوشهر", 
    "یاسوج", "شهرکرد", "سمنان", "ایلام"
];


export const unitCategories: { [key: string]: string[] } = {
  length: ['meter', 'kilometer', 'centimeter', 'millimeter', 'mile', 'yard', 'foot', 'inch'],
  mass: ['kilogram', 'gram', 'milligram', 'pound', 'ounce'],
  temperature: ['celsius', 'fahrenheit', 'kelvin'],
  volume: ['liter', 'milliliter', 'cubic-meter', 'gallon', 'quart', 'pint', 'cup'],
};

export const unitNames = {
    'طول': {
        meter: 'متر (m)',
        kilometer: 'کیلومتر (km)',
        centimeter: 'سانتی‌متر (cm)',
        millimeter: 'میلی‌متر (mm)',
        mile: 'مایل (mile)',
        yard: 'یارد (yd)',
        foot: 'فوت (ft)',
        inch: 'اینچ (in)',
    },
    'جرم': {
        kilogram: 'کیلوگرم (kg)',
        gram: 'گرم (g)',
        milligram: 'میلی‌گرم (mg)',
        pound: 'پوند (lb)',
        ounce: 'اونس (oz)',
    },
    'دما': {
        celsius: 'سلسیوس (°C)',
        fahrenheit: 'فارنهایت (°F)',
        kelvin: 'کلوین (K)',
    },
    'حجم': {
        liter: 'لیتر (L)',
        milliliter: 'میلی‌لیتر (mL)',
        'cubic-meter': 'متر مکعب (m³)',
        gallon: 'گالن (gal)',
        quart: 'کوارت (qt)',
        pint: 'پاینت (pt)',
        cup: 'فنجان (cup)',
    }
};

export const allUnits = Object.values(unitCategories).flat();

export const plateLetters = [
  'الف', 'ب', 'پ', 'ت', 'ث', 'ج', 'چ', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'ژ', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ک', 'گ', 'ل', 'م', 'ن', 'و', 'ه', 'ی'
];

export const plateCodes: { [key: number]: { province: string; cities: { [letter: string]: string } } } = {
  10: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  11: { province: "تهران", cities: { ب: "شمال تهران", ج: "جنوب تهران", د: "شرق تهران", س: "شمال تهران", ص: "شرق تهران", ط: "شمال تهران", ق: "جنوب تهران", ل: "شرق تهران", م: "غرب تهران", ن: "غرب تهران", و: "جنوب تهران", ه: "غرب تهران", ی: "شرق تهران" } },
  12: { province: "خراسان رضوی", cities: { ب: "مشهد", ج: "مشهد", د: "مشهد", س: "مشهد", ص: "مشهد", ط: "مشهد", ق: "مشهد", ل: "مشهد", م: "مشهد", ن: "مشهد", و: "مشهد", ه: "مشهد", ی: "مشهد" } },
  13: { province: "اصفهان", cities: { ب: "اصفهان", ج: "اصفهان", د: "اصفهان", س: "اصفهان", ص: "اصفهان", ط: "اصفهان", ق: "اصفهان", ل: "اصفهان", م: "اصفهان", ن: "اصفهان", و: "اصفهان", ه: "اصفهان", ی: "اصفهان" } },
  14: { province: "خوزستان", cities: { ب: "اهواز", ج: "اهواز", د: "اهواز", س: "اهواز", ص: "اهواز", ط: "اهواز", ق: "اهواز", ل: "اهواز", م: "اهواز", ن: "اهواز", و: "اهواز", ه: "اهواز", ی: "اهواز" } },
  15: { province: "آذربایجان شرقی", cities: { ب: "تبریز", ج: "تبریز", د: "تبریز", س: "تبریز", ص: "تبریز", ط: "تبریز", ق: "تبریز", ل: "تبریز", م: "تبریز", ن: "تبریز", و: "تبریز", ه: "تبریز", ی: "تبریز" } },
  16: { province: "قم", cities: {} },
  17: { province: "آذربایجان غربی", cities: { ب: "ارومیه", ج: "ارومیه", د: "ارومیه", س: "ارومیه", ص: "ارومیه", ط: "ارومیه", ق: "ارومیه", ل: "ارومیه", م: "ارومیه", ن: "ارومیه", و: "ارومیه", ه: "ارومیه" } },
  18: { province: "همدان", cities: { ب: "همدان", ج: "همدان", د: "همدان", س: "همدان", ص: "همدان", ق: "همدان", ل: "همدان", ط: "همدان" } },
  19: { province: "کرمانشاه", cities: { ب: "کرمانشاه", ج: "کرمانشاه", د: "کرمانشاه", س: "کرمانشاه", ص: "کرمانشاه", ط: "کرمانشاه", ق: "کرمانشاه", ل: "کرمانشاه", م: "کرمانشاه", ن: "کرمانشاه", ه: "کرمانشاه", و: "کرمانشاه" } },
  20: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  21: { province: "تهران", cities: { ب: "اسلام‌شهر", ج: "رباط‌کریم", د: "شهریار", س: "ورامین", ط: "شهریار", ق: "رباط‌کریم", ل: "شهریار", م: "ورامین", ن: "پاکدشت", ه: "شهریار", ی: "دماوند" } },
  22: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  23: { province: "اصفهان", cities: { ب: "کاشان", ج: "نجف‌آباد", د: "شهرضا", س: "خمینی‌شهر", ص: "گلپایگان", ط: "نطنز", ق: "اردستان", ل: "خوانسار", م: "ناپین", ن: "سمیرم", ه: "فلاورجان", و: "فریدون‌شهر", ی: "لنجان" } },
  24: { province: "خوزستان", cities: { ب: "آبادان", ج: "خرمشهر", د: "دزفول", س: "بهبهان", ص: "مسجد سلیمان", ط: "ماهشهر", ق: "دشت آزادگان", ل: "رامهرمز", م: "اندیمشک", ن: "شوشتر", ه: "شادگان", و: "شوش", ی: "ایذه" } },
  25: { province: "آذربایجان شرقی", cities: { ب: "مراغه", ج: "مرند", د: "اهر", س: "سراب", ص: "جلفا", ط: "هشترود", ق: "بناب", ل: "بستان‌آباد", م: "شبستر", ن: "کلیبر", و: "هریس", ی: "آذرشهر" } },
  26: { province: "خراسان شمالی", cities: { ب: "بجنورد", ج: "بجنورد", د: "بجنورد", ص: "شیروان", ط: "اسفراین", ق: "جاجرم و گرمه", ل: "مانه و سملقان", م: "فاروج" } },
  27: { province: "آذربایجان غربی", cities: { ب: "خوی", ج: "مهاباد", د: "ماکو", س: "سلماس", ص: "نقده", ط: "میاندوآب", ق: "تکاب", ل: "شاهین‌دژ", م: "سردشت", ن: "بوکان", ه: "پیرانشهر", و: "اشنویه", ی: "چالدران" } },
  28: { province: "همدان", cities: { ب: "نهاوند", ج: "ملایر", د: "تویسرکان", س: "کبودرآهنگ", ص: "رزن", ط: "بهار", ق: "اسدآباد", ل: "ملایر", م: "نهاوند", ن: "ملایر" } },
  29: { province: "کرمانشاه", cities: { ب: "اسلام‌آباد غرب", ج: "گیلان‌ غرب", د: "سرپل‌ذهاب", س: "پاوه", ص: "کنگاور", ط: "قصرشیرین", ق: "سقز", ل: "جوانرود", م: "صحنه", ن: "هرسین", ه: "اسلام‌آباد غرب", و: "ثلاث باباجانی" } },
  30: { province: "تهران", cities: { د: "کرج", س: "کرج", ل: "کرج", م: "کرج", ه: "کرج", ب: "شهریار", ج: "رباط‌کریم", ص: "اسلام‌شهر", ط: "پاکدشت", ق: "شهریار", ن: "شهریار", و: "رباط‌کریم" } },
  31: { province: "لرستان", cities: { ب: "خرم‌آباد", ج: "خرم‌آباد", د: "خرم‌آباد", س: "خرم‌آباد", ص: "خرم‌آباد" } },
  32: { province: "خراسان رضوی", cities: { د: "بیرجند", ب: "نیشابور", ج: "سبزوار", ص: "تربت‌جام", ط: "قوچان", ق: "گناباد", ل: "تربت‌حیدریه", م: "کاشمر", ن: "تربت‌حیدریه", ه: "تایباد", و: "مشهد", ی: "نیشابور" } },
  33: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  34: { province: "خوزستان", cities: { ب: "باغملک", ج: "امیدیه", د: "هندیجان", س: "لالی", ص: "دزفول", ط: "ماهشهر", ق: "آبادان", ن: "بهبهان", ه: "شوشتر", و: "دزفول", ی: "اهواز" } },
  35: { province: "آذربایجان شرقی", cities: { ب: "اسکو", ج: "ورزقان", د: "عجب‌شیر", س: "چاراویماق", ص: "ملکان", ط: "مرند", ق: "مراغه", ل: "تبریز", م: "تبریز", ن: "میانه", ه: "اهر", ی: "تبریز" } },
  36: { province: "خراسان رضوی", cities: { ب: "مشهد", ج: "مشهد", د: "مشهد", س: "مشهد", ص: "مشهد", ط: "مشهد", ق: "کاشمر", ل: "نیشابور", م: "سبزوار", ن: "تربت حیدریه", ه: "مشهد", و: "مشهد", ی: "تربت‌جام" } },
  37: { province: "آذربایجان غربی", cities: { ب: "خوی", ج: "میاندوآب", د: "نقده", ص: "مهاباد", ط: "بوکان", ق: "سلماس", ل: "ماکو", م: "خوی", ن: "میاندوآب" } },
  38: { province: "البرز", cities: { ب: "کرج", ج: "کرج", د: "کرج", س: "کرج", ص: "کرج", ط: "کرج", ق: "کرج", ل: "کرج", م: "کرج", ن: "کرج", و: "کرج", ه: "کرج", ی: "کرج" } },
  39: { province: "کرمانشاه", cities: {} },
  40: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  41: { province: "لرستان", cities: { ب: "بروجرد", ج: "الیگودرز", د: "دورود", س: "کوهدشت", ص: "دلفان", ط: "ازنا", ق: "پل دختر", ل: "سلسله", م: "بروجرد", ن: "بروجرد", و: "دورود" } },
  42: { province: "خراسان رضوی", cities: { ب: "فریمان", ج: "مشهد", د: "سرخس", س: "درگز", ص: "خواف", ط: "چناران", ق: "مشهد", ل: "بردسکن", م: "رشتخوار", ن: "سبزوار", ه: "مشهد", و: "مشهد", ی: "کلات" } },
  43: { province: "اصفهان", cities: { ب: "فریدن", ج: "مبارکه", د: "شاهین‌شهر و میمه", س: "آران و بیدگل", ص: "تیران و کرون", ط: "مبارکه", ق: "دهاقان", ل: "شاهین‌شهر و میمه", م: "نجف‌آباد", ن: "خمینی‌شهر", ه: "لنجان", و: "کاشان", ی: "فلاورجان" } },
  44: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  45: { province: "کرمان", cities: { ب: "کرمان", ج: "کرمان", د: "کرمان", س: "کرمان", ص: "کرمان", ط: "کرمان", ق: "کرمان", ل: "کرمان", م: "کرمان", ن: "کرمان" } },
  46: { province: "گیلان", cities: { ب: "رشت", ج: "رشت", د: "رشت", س: "رشت", ص: "رشت", ط: "رشت", ق: "رشت", ل: "رشت", م: "رشت", ن: "رشت", و: "رشت" } },
  47: { province: "مرکزی", cities: { ب: "اراک", ج: "اراک", د: "اراک", س: "اراک", ص: "اراک", ط: "اراک", ق: "اراک" } },
  48: { province: "بوشهر", cities: { ب: "بوشهر", ج: "بوشهر", د: "بوشهر", س: "بوشهر", ص: "بوشهر" } },
  49: { province: "کهگیلویه و بویراحمد", cities: { ب: "یاسوج", ج: "یاسوج", د: "یاسوج", ص: "گچساران", ط: "کهگیلویه", ق: "دنا", ل: "گچساران" } },
  50: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  51: { province: "کردستان", cities: {} },
  52: { province: "خراسان جنوبی", cities: { ب: "بیرجند", ج: "بیرجند", د: "بیرجند", ص: "قاپنات", ط: "فردوس", ق: "نهبندان", ل: "سربیشه" } },
  53: { province: "اصفهان", cities: { ب: "اصفهان", ج: "اصفهان", د: "اصفهان", س: "اصفهان", ص: "اصفهان", ط: "شهرضا", ق: "اصفهان", ل: "اصفهان", م: "شاهین‌شهر و میمه", ن: "نجف‌آباد", ه: "کاشان", و: "اصفهان", ی: "خمینی‌شهر" } },
  54: { province: "یزد", cities: { ب: "یزد", ج: "یزد", د: "یزد", س: "یزد", ص: "یزد", ط: "یزد", ق: "یزد", ل: "یزد", m: "یزد", ن: "یزد" } },
  55: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  56: { province: "گیلان", cities: { ب: "انزلی", ج: "لاهیجان", د: "آستارا", س: "طالش", ص: "رودسر", ط: "رودبار", ق: "صومعه‌سرا", ل: "فومن", م: "لنگرود", ن: "رضوان‌شهر", ه: "ماسال", و: "املش", ی: "شفت" } },
  57: { province: "مرکزی", cities: { ب: "ساوه", ج: "خمین", د: "محلات", س: "تفرش", ص: "دلیجان", ط: "آشتیان", ق: "شازند", ل: "زرندیه", ن: "کمیجان", ه: "ساوه", و: "ساوه" } },
  58: { province: "بوشهر", cities: { ب: "دشتستان", ج: "گناوه", د: "کنگان", س: "تنگستان", ص: "دشتی", ط: "دیر", ق: "دیلم", ل: "جم", م: "دشتستان", ن: "کنگان" } },
  59: { province: "گلستان", cities: { ب: "گنبد کاووس", ج: "بندرترکمن", د: "کردکوی", س: "علی‌آباد", ص: "آزادشهر", ط: "مینودشت", ق: "بندرگز", ل: "رامیان", م: "آق‌قلا", ن: "کلاله", ه: "گنبد کاووس" } },
  60: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  61: { province: "کردستان", cities: { ب: "سقز", ج: "بیجار", د: "بانه", س: "قروه", ص: "مریوان", ط: "دیواندره", ق: "کامیاران", ل: "سروآباد", m: "سقز", ن: "قروه", ه: "بانه", و: "مریوان" } },
  62: { province: "مازندران", cities: { ب: "ساری", ج: "ساری", د: "ساری", س: "ساری", ص: "ساری", ط: "ساری" } },
  63: { province: "فارس", cities: { ب: "شیراز", ج: "شیراز", د: "شیراز", س: "شیراز", ص: "شیراز", ط: "شیراز", ق: "شیراز", ل: "شیراز", م: "شیراز", ن: "شیراز", و: "شیراز", ه: "شیراز", ی: "شیراز" } },
  64: { province: "یزد", cities: { ب: "اردکان", ج: "تفت", د: "میبد", س: "بافق", ص: "مهریز", ط: "ابرکوه", ل: "خاتم", m: "صدوق (اشکذر)" } },
  65: { province: "کرمان", cities: { ب: "رفسنجان", ج: "بم", د: "سیرجان", س: "بافت", ص: "جیرفت", ط: "زرند", ق: "کهنوج", ل: "شهر بابک", م: "بردسیر", ن: "منوجان", ه: "راور", و: "عنبرآباد", ی: "رفسنجان" } },
  66: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  67: { province: "اصفهان", cities: { ب: "اصفهان", ج: "اصفهان", د: "اصفهان", س: "اصفهان", ط: "اصفهان", ل: "اصفهان", م: "اصفهان", ن: "اصفهان", و: "اصفهان", ق: "شاهین‌شهر و میمه", ص: "فلاورجان" } },
  68: { province: "البرز", cities: { ب: "کرج", ج: "کرج", د: "کرج", س: "کرج", ص: "کرج", ط: "کرج", ق: "کرج", ل: "کرج", م: "کرج", ن: "کرج", و: "کرج", ه: "کرج", ی: "کرج" } },
  69: { province: "گلستان", cities: {} },
  71: { province: "چهارمحال و بختیاری", cities: { ب: "شهرکرد", ج: "شهرکرد", د: "شهرکرد", س: "شهرکرد", ص: "شهرکرد" } },
  72: { province: "مازندران", cities: { ب: "آمل", ج: "بابل", د: "تنکابن", س: "رامسر", ص: "نوشهر", ط: "نور", ق: "بهشهر", ل: "قائمشهر", م: "بابلسر", ن: "چالوس", ه: "نکا", و: "محمودآباد", ی: "نور" } },
  73: { province: "فارس", cities: { ب: "جهرم", ج: "لارستان", د: "داراب", س: "فسا", ص: "کازرون", ط: "فیروزآباد", ق: "آباده", ل: "مرودشت", م: "لامرد", ن: "نی‌ریز", ه: "اقلید", و: "استهبان", ی: "ممسنی" } },
  74: { province: "خراسان رضوی", cities: { ب: "مشهد", د: "مشهد", س: "مشهد", ص: "مشهد", ط: "نیشابور", ق: "مشهد", ل: "سبزوار", م: "مشهد", ن: "گناباد", ه: "مشهد", و: "مشهد", ی: "مشهد", ج: "قوچان" } },
  75: { province: "کرمان", cities: { ب: "سیرجان", ج: "بم", د: "جیرفت", s: "رفسنجان", ص: "سیرجان", ط: "زرند", ق: "کهنوج", ل: "رفسنجان", m: "سیرجان" } },
  76: { province: "گیلان", cities: { ب: "سیاهکل", ج: "آستانه", د: "لاهیجان", س: "انزلی", ص: "لنگرود", ط: "طالش", ق: "رودسر" } },
  77: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  78: { province: "البرز", cities: { ط: "ساوجبلاغ" } },
  79: { province: "قزوین", cities: { ب: "قزوین", ج: "قزوین", د: "قزوین", س: "قزوین", ص: "قزوین", ط: "قزوین", ق: "قزوین", ل: "قزوین", م: "قزوین" } },
  81: { province: "چهارمحال و بختیاری", cities: { ب: "بروجن", ج: "اردل", د: "فارسان", س: "لردگان", ص: "کوهرنگ", ق: "بروجن" } },
  82: { province: "مازندران", cities: { ب: "آمل", ج: "بابل", د: "تنکابن", s: "قائمشهر", ص: "بابل", ط: "تنکابن", ق: "آمل", ل: "بابلسر", م: "بابل", ن: "قائمشهر", ه: "بهشهر", و: "چالوس", ی: "نوشهر" } },
  83: { province: "فارس", cities: { ب: "ممسنی", ج: "زرین‌دشت", د: "قیرکازرین", س: "مهر", ص: "ارسنجان", ط: "خرمبید", ق: "بوانات", ل: "فراشبند", م: "لارستان", ن: "کازرون", ه: "جهرم", و: "مرودشت", ی: "فسا" } },
  84: { province: "هرمزگان", cities: { ب: "بندرعباس", ج: "بندرعباس", د: "بندرعباس", س: "بندرعباس", ص: "بندرعباس", ط: "بندرعباس", ق: "بندرعباس", ل: "بندرعباس" } },
  85: { province: "سیستان و بلوچستان", cities: { ب: "زاهدان", ج: "زاهدان", د: "زاهدان", س: "زاهدان", ص: "زاهدان", ط: "زاهدان" } },
  86: { province: "سمنان", cities: { ب: "سمنان", ج: "سمنان", د: "سمنان" } },
  87: { province: "زنجان", cities: { ب: "زنجان", ج: "زنجان", د: "زنجان", س: "زنجان", ص: "زنجان", ط: "زنجان" } },
  88: { province: "تهران", cities: { ب: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
  89: { province: "قزوین", cities: { ب: "تاکستان", ج: "بویین زهرا", d: "آبیک", س: "تاکستان" } },
  91: { province: "اردبیل", cities: { ب: "اردبیل", ج: "اردبیل", د: "اردبیل", س: "پارس‌آباد", ص: "خلخال", ط: "گرمی", ل: "مشکین‌شهر", م: "کوثر", ن: "نمین", ه: "اردبیل", و: "کوثر", ی: "پارس‌آباد" } },
  92: { province: "مازندران", cities: { ب: "آمل", ج: "بابل", د: "تنکابن", s: "قائمشهر", ص: "بابل" } },
  93: { province: "فارس", cities: { ب: "شیراز", ج: "شیراز", د: "شیراز", س: "شیراز", ص: "شیراز", ط: "شیراز", ق: "شیراز", ل: "لارستان", م: "شیراز", ن: "شبراز", و: "فیروزآباد", ی: "کازرون" } },
  94: { province: "هرمزگان", cities: { ب: "میناب", ج: "بندر لنگه", د: "رودان", س: "ابوموسی", ص: "جاسک", ط: "بستک", ق: "حاجی‌آباد", ل: "قشم", م: "میناب", ن: "بندر لنگه" } },
  95: { province: "سیستان و بلوچستان", cities: { ب: "زابل", ج: "ایرانشهر", د: "خاش", س: "سراوان", ص: "نیکشهر", ط: "سرباز", ق: "چابهار", ل: "زابل", م: "ایرانشهر", ن: "سراوان", و: "زابل" } },
  96: { province: "سمنان", cities: { ب: "دامغان", ج: "شاهرود", د: "گرمسار", s: "مهدی‌شهر", ص: "شاهرود", ط: "شاهرود" } },
  97: { province: "زنجان", cities: { ب: "ابهر", ج: "خدابنده", د: "خرم‌دره", s: "ایجرود", ص: "طارم", ط: "ماه‌نشان", ق: "ابهر" } },
  98: { province: "ایلام", cities: { ب: "ایلام", ج: "ایلام", د: "ایلام", ص: "مهران", ط: "بدره", ق: "دهلران", ل: "چرداول", م: "ایوان", ن: "ابدانان" } },
  99: { province: "تهران", cities: { b: "تهران بزرگ", ج: "تهران بزرگ", د: "تهران بزرگ", س: "تهران بزرگ", ص: "تهران بزرگ", ط: "تهران بزرگ", ق: "تهران بزرگ", ل: "تهران بزرگ", م: "تهران بزرگ", ن: "تهران بزرگ", و: "تهران بزرگ", ه: "تهران بزرگ", ی: "تهران بزرگ" } },
};
